app/views/plays/admin_edit.html.erb

SELECT `categories`.* FROM `categories`
---
                            <!-- 第二引数の1項目目が画面に表示され、2項目目がvalue値にセットされる -->
                            <%= f.select :category_id, @categories.map{|t| [t.category_name, t.id]},class: "form-control" %>