app/views/users/admin.html.erb

                                        <!-- 長すぎた場合は、文字数をカットする。 -->
                                        <% if play.play_explain.length >= 50 %>
---
SELECT `plays`.* FROM `plays`