app/views/events/new.html.erb

                    <!-- 第二引数の1項目目が画面に表示され、2項目目がvalue値にセットされる -->
                    <%= f.select :play_id, @plays.map{|t| [t.play_title, t.id]} %>
---
SELECT `plays`.* FROM `plays`