app/controllers/events_controller.rb

  def index
    # 承認フラグ立っているイベントのみ表示されるようにする
    #@events = Event.where(event_confirm_flg: 1)

    # 現在時刻の取得
    time_now_tokyo = DateTime.now.in_time_zone('Tokyo')

    # 承認フラグが立っており、かつ募集時刻が現在時刻を過ぎていないイベントを一覧で表示
    @events = Event.where("event_finish_time > ?", time_now_tokyo).where(event_confirm_flg: 1)
---
SELECT `events`.* FROM `events` WHERE (event_finish_time > '2019-07-18 12:25:42.832700') AND `events`.`event_confirm_flg` = 1

  def show
    @event = Event.find(params[:id])


    # ユーザーがイベントに参加済みかを検索し、参加済みの場合フラグを立てる
    if current_user != nil
      if EventJoin.find_by(event_id: @event.id, user_id: current_user.id) != nil
        @event_join_flg = 1
      else
        @event_join_flg = 0
      end
    else
      @event_join_flg = 0
    end

    # 自分自身が作成したイベントに参加できないようにする
    if current_user != nil
      # 管理者もイベント参加できないようにする
      if @event.user_id == current_user.id || current_user.admin_flg == 1
        @event_my_flg = 1
      else
        @event_my_flg = 0
      end
    else
      @event_my_flg = 0
    end

    #
    # 消費税を計算させる処理
    #
    taxes = Tax.all
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
SELECT  `event_joins`.* FROM `event_joins` WHERE `event_joins`.`event_id` = 1 AND `event_joins`.`user_id` = 1 LIMIT 1
SELECT `taxes`.* FROM `taxes`

    # 処理終了

    # イベント参加者をカウントする処理
    @event_count = EventJoin.where(event_id: @event.id).count
---
SELECT COUNT(*) FROM `event_joins` WHERE `event_joins`.`event_id` = 1

  def join
    event = Event.find(params[:id])
    event_join = EventJoin.new

    # すでに参加している場合と、募集時間外は保存できなくする
    if EventJoin.find_by(event_id: event.id, user_id: current_user.id) != nil ||
      event.collect_start_now_finish? == false

      # 処理しません
      redirect_to event_path(event.id)
    # 参加をまだしていない場合
    else

      # 値をセットする
      event_join.event_id = event.id
      event_join.user_id = current_user.id


      # save成功時は参加完了ページ、失敗時はイベント詳細画面に戻す
      if event_join.save
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
SELECT  `event_joins`.* FROM `event_joins` WHERE `event_joins`.`event_id` = 1 AND `event_joins`.`user_id` = 1 LIMIT 1
INSERT INTO `event_joins` (`event_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2019-07-20 08:13:02', '2019-07-20 08:13:02')

  def new
    @event = Event.new
    # プルダウンで遊びを選択させるため、遊びの一覧を渡す
    @plays = Play.all
---
SELECT `plays`.* FROM `plays`

  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id

    # エラー文を格納する関数を定義する
    @create_error_array = Array.new

    # 必須のパラメータが入っているか確認し、入っていない場合は元の画面に戻す
    if @event.essential_params_check? == false
      @create_error_array.push("入力されていない必須項目があります。")
      # プルダウンで遊びを選択させるため、遊びの一覧を渡す
      @plays = Play.all
      # renderは表示させているだけなので、returnがないと先に処理がすすんでしまう。
      return render "new"
    end

    if @event.event_save_before_check?(@create_error_array) == false
      # プルダウンで遊びを選択させるため、遊びの一覧を渡す
      @plays = Play.all
      return render "new"
    end

    # save成功時はマイページ、失敗時はnew画面に戻す
    if @event.save
---
SELECT `plays`.* FROM `plays`
INSERT INTO `events` (`play_id`, `user_id`, `event_title`, `event_explain`, `event_image_id`, `event_place`, `event_people_min`, `event_people_max`, `honorarium`, `event_hold_start_time`, `event_hold_finish_time`, `event_start_time`, `event_finish_time`, `created_at`, `updated_at`) VALUES (1, 2, '藤の撮影会', '足長フラワーパークで写真撮影を楽しもう！！\r\n暗い中撮影するにはテクが必要です。', '198d4056b4ac2d572e9fc03f74b4f17a60df892a3a261b746d7f2d772ee9', '足長フラワーパーク', 3, 5, 10000, '2020-04-01 01:00:00', '2020-04-01 09:00:00', '2019-10-01 01:00:00', '2020-03-01 01:00:00', '2019-07-20 08:10:34', '2019-07-20 08:10:34')

  def edit
    @event = Event.find(params[:id])
    # プルダウンで遊びを選択させるため、遊びの一覧を渡す
    @plays = Play.all
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
SELECT `plays`.* FROM `plays`

  def update
    @event = Event.find(params[:id])
    check_event = Event.new(event_params)
    # プルダウンで遊びを選択させるため、遊びの一覧を渡す
    @plays = Play.all

    # エラー文を格納する関数を定義する
    @edit_error_array = Array.new

    # 必須のパラメータが入っているか確認し、入っていない場合は元の画面に戻す
    if check_event.essential_params_check? == false
      @edit_error_array.push("入力されていない必須項目があります。")
      # renderは表示させているだけなので、returnがないと先に処理がすすんでしまう。
      return render "edit"
    end

    if check_event.event_save_before_check?(@edit_error_array) == false
      return render "edit"
    end

    # save成功時はマイページ、失敗時はedit画面に戻す
    if @event.update(event_params)
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
UPDATE `events` SET `event_image_id` = '198d4056b4ac2d572e9fc03f74b4f17a60df892a3a261b746d7f2d772ee9', `event_people_min` = 5, `event_people_max` = 7, `updated_at` = '2019-07-20 08:14:02' WHERE `events`.`id` = 1

  def destroy
    # 主催しているイベントを取得する。
    event = Event.find(params[:id])

    flash[:notice] = "イベント削除が完了しました"

    event.destroy
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 1

  def admin_accept
    event = Event.find(params[:id])
    event.event_confirm_flg = 1
    event.save
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
UPDATE `events` SET `event_confirm_flg` = 1, `updated_at` = '2019-07-20 08:12:28' WHERE `events`.`id` = 1