app/controllers/plays_controller.rb

  def index
    @plays = Play.all
---
SELECT `plays`.* FROM `plays`

  def show
    @play = Play.find(params[:id])
    @events = Event.where(play_id: @play.id)
---
SELECT  `plays`.* FROM `plays` WHERE `plays`.`id` = 1 LIMIT 1
SELECT `events`.* FROM `events` WHERE `events`.`play_id` = 1

  def admin_new
    @play = Play.new
    # プルダウンでジャンルを選択させるため、ジャンルの一覧を渡す
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def admin_create

    @play = Play.new(play_params)

    # save成功時は管理者ページ、失敗時はnew画面に戻す
    if @play.save
---
INSERT INTO `plays` (`category_id`, `play_title`, `play_explain`, `play_image_id`, `created_at`, `updated_at`) VALUES (2, '写真撮影', '外で綺麗な写真を撮りませんか？\r\nとてもいい思い出になりますよ。', '41df8d1ed22754c744412a2689ed3450aa928b0132d9bb809180306ed6e9', '2019-07-20 08:04:10', '2019-07-20 08:04:10')

  def admin_edit
    @play = Play.find(params[:id])
    # カテゴリ表示のため、取得
    @categories = Category.all
---
SELECT  `plays`.* FROM `plays` WHERE `plays`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`

  def admin_update
    @play = Play.find(params[:id])

    if @play.update(play_params)
---
SELECT  `plays`.* FROM `plays` WHERE `plays`.`id` = 1 LIMIT 1
UPDATE `plays` SET `play_title` = '写真撮影2', `play_image_id` = '41df8d1ed22754c744412a2689ed3450aa928b0132d9bb809180306ed6e9', `updated_at` = '2019-07-20 08:16:21' WHERE `plays`.`id` = 1

  def admin_destroy
    play = Play.find(params[:id])

    play.destroy
---
SELECT  `plays`.* FROM `plays` WHERE `plays`.`id` = 1 LIMIT 1
DELETE FROM `plays` WHERE `plays`.`id` = 1