app/controllers/users_controller.rb

SELECT `event_joins`.* FROM `event_joins` WHERE `event_joins`.`user_id` = 1
SELECT `events`.* FROM `events` WHERE `events`.`user_id` = 1
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `event_joins` WHERE `event_joins`.`event_id` = 1
---
  def show
    @user = current_user
    # 参加しているイベントだけDBから持ってくる
    @event_joins = EventJoin.where(user_id: @user.id)

    # 主催しているイベントだけDBから持ってくる
    @events = Event.where(user_id: @user.id)

    # 参加者の数を計算して、@event_counts_arrayに格納する処理
    @event_counts_array = Array.new
    @events.each do |event|
      @event_counts_array.push(EventJoin.where(event_id: event.id).count)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$11$2eHcPamoH39hgaxcFPgsZejU2YlHYCSMinr8VnfcuV1Q.H73dYbiy', `user_image_id` = '9f940818f03c1b245a2e6186f63e3942f1ff76f8002cb1c1b83c074db521', `user_profile` = 'テスト用のデータです。', `updated_at` = '2019-07-20 08:06:54' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `resignation_flg` = 1, `updated_at` = '2019-07-20 08:16:48' WHERE `users`.`id` = 2
---
  def destroy
    user = current_user

    # ユーザー側:退会のみ可能
    # 管理者側: 退会、退会キャンセル両方可能

    # 管理者の場合
    if user.admin_flg == 1



      user = User.find(params[:id])
      # 退会フラグが立っていない場合は、退会させる。
      # 退会フラグが立っている場合は、退会キャンセルさせる。
      if user.resignation_flg == nil
        flash[:notice] = "ユーザーを退会状態にしました"
        user.resignation_flg = 1
      else
        if user.resignation_flg == 0
          flash[:notice] = "ユーザーを退会状態にしました"
          user.resignation_flg = 1
        else
          flash[:notice] = "ユーザーの退会状態を解除しました"
          user.resignation_flg = 0
        end
      end

      user.save

SELECT `users`.* FROM `users`
SELECT `plays`.* FROM `plays`
SELECT `events`.* FROM `events`
SELECT COUNT(*) FROM `event_joins` WHERE `event_joins`.`event_id` = 1
---
  def admin
    @users = User.all
    @plays = Play.all
    @events = Event.all

    # 参加者の数を計算して、@event_counts_arrayに格納する処理
    @event_counts_array = Array.new
    @events.each do |event|
      @event_counts_array.push(EventJoin.where(event_id: event.id).count)